Revit 2026 API

# FlexPipeCreate(Document, ElementId, ElementId, ElementId, IListXYZ) Method

---
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FlexPipe Create(
	Document document,
	ElementId systemTypeId,
	ElementId pipeTypeId,
	ElementId levelId,
	IList<XYZ> points
)
```
```vb
Public Shared Function Create (
	document As Document,
	systemTypeId As ElementId,
	pipeTypeId As ElementId,
	levelId As ElementId,
	points As IList(Of XYZ)
) As FlexPipe
```
```cpp
public:
static FlexPipe^ Create(
	Document^ document,
	ElementId^ systemTypeId,
	ElementId^ pipeTypeId,
	ElementId^ levelId,
	IList<XYZ^>^ points
)
```
```fsharp
static member Create :
        document : Document *
        systemTypeId : ElementId *
        pipeTypeId : ElementId *
        levelId : ElementId *
        points : IList<XYZ> -> FlexPipe
```

#### Parameters

document Document

systemTypeId ElementId

pipeTypeId ElementId

levelId ElementId

points IListXYZ

#### Return Value

FlexPipe

#### Reference

FlexPipe Class

Create Overload

Autodesk.Revit.DB.Plumbing Namespace